# Сколько 8-буквенных слов может составить Петя из букв П, Е, Т, Я,
# если буква П должна использоваться менее трёх раз
# и при этом должна стоять рядом с Е и не может быть на последней позиции?
# Каждая буква может использоваться несколько раз или не использоваться совсем.

from itertools import product


# a = "ПЕТЯ" # Алфавит к задаче
# c = set() # Множество подходящих слов
#
#
# for i in product(a, repeat = 8):
#
#     # Объединим буквы
#     s = "".join(i)
#
#     # Если меньше трёх П и последняя буква не П
#     if s.count("П") < 3 and s[-1] != "П":
#
#         # Переменная-флаг
#         f = 1
#
#
#         # Добавляем буферный символ в начало, чтобы w1[i - 1] отрабатывало корректно
#         # Для первого символа
#         s1 = "_" + s
#         for g in range(1, len(s1) - 1):
#             if s1[g] == "П" and s1[g - 1] != "Е" and s1[g + 1] != "Е": # Рядом с П не стоит Е
#                 f = 0
#                 break
#         # Только если флаг остался 1
#         if f == 1:
#             # Добавим в множество
#             c.add(s)
#
# print(len(c))

