# Максим Олегович составляет 6-буквенные слова, в которых есть только буквы М, А, Ш, И, Н,
# причём в слове должна быть хотя бы одна согласная буква.
# Все буквы могут встречаться в слове любое количество раз или не встречаться совсем, если соблюдаются условия.
# Сколько существует таких слов, в которых будет ровно одна гласная буква?

from itertools import *

a = 'МАШИН'
c = 0

for i in product(a, repeat=6):

    s = ''.join(i)
    t = [g for g in s if g in 'МШН']
    gl = [g for g in s if g in 'АИ']
    if (len(t) >= 1) and len(gl) == 1:
        print(s)
        c += 1

print(c)