# Олег составляет 4-буквенные слова, в которых есть только буквы К, Р, А, Б,
# причём буква К используется в каждом слове ровно 1 раз.
# Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем.
# Словом считается любая допустимая последовательность букв, не обязательно осмысленная.
# Сколько существует таких слов, которые может написать Олег?

from itertools import *


a = 'КРАБ'
c = 0

for i in product(a, repeat=4):
    s = ''.join(i)

    if (s.count('К') == 1):
        c += 1

print(c)