def prime(n): # Функция для выявления простых чисел
    for d in range(2, int(n ** 0.5) + 1): # Перебираем возможные делители числа n (от
        if n % d == 0: # Если делитель нашёлся - число не является простым,
            return False # возвращаем ложь
    return n > 1

# Если делитель не был найден и n не равно 1 - число простое, возвращаем
def max_divs(n): # Функция, возвращающая подходящий максимальный делитель (если он сущес
    for d in range(2, int(n ** 0.5) + 1): # Перебираем делители от 2 до корня
        if n % d == 0: # Если d является делителем числа n,
            if not prime(n // d): # проверяем, является парный делитель для d простым ч
                return n // d # Если делитель подошёл - возвращаем данное значение,
            return False # иначе возвращаем ложь, максимальный делитель - простое число
    return False # Выходим из функции, вернув ложь, если не встретился ни один делитель


count = 0 # Количество проверенных подходящих чисел
for x in range(650001, 10 ** 100): # Перебираем числа, большие 650000
    k = max_divs(x) # Находим максимальный делитель, не являющийся простым числом (если
    if k != 0: # Если подходящий делитель нашёлся,
        count += 1 # увеличиваем количество на 1,
        print(x, k, end=" ") # выводим искомые значения на экран
    if count == 6: # Если были найдены 6 подходящих чисел,
        break # останавливаем цикл