# Арез составляет шестибуквенные слова из букв слова НАКОВАЛЬНЯ.
# Каждая буква может встречаться в слове только один раз,
# на первом месте не может стоять буква Ь,
# а буква Л может стоять только в окружении гласных.
# Сколько слов может составить Арез?

from itertools import *

a = set('НАКОВАЛЬНЯ')
c = 0
bad = ['ЛН', 'ЛК', 'ЛВ', 'ЛЬ', 'НЛ', 'КЛ', 'ВЛ', 'ЬЛ']

for i in permutations(a, 6):
    s = ''.join(i)
    t = [not j in s for j in bad]

    if (s[0] != 'Ь') and all(t) and s[0] != 'Л' and (s[-1] != 'Л'):
        c += 1
        print(s)

print(c)