for x in range(20560, 100000):
    c = set()
    for i in range(1, int(x**0.5)+1):
        if (x % i == 0) and (i % 6 == 0):
            c.add(i)

    if len(c) == 3:
        print(x, max(c))

# c = 0
# # Перебираем все числа в диапазоне от 20561 до 29999 включительно
# for i in range(20561, 30000):
# # Создаем пустой список для хранения делителей, кратных 6
#     ds = []
#     # Перебираем возможные делители от 2 до квадратного корня из i
#     for d in range(2, int(i**0.5) + 1):
#     # Проверяем, является ли d делителем числа i
#         if i % d == 0:
# # Если делитель d кратен 6, добавляем его в список
#             if d % 6 == 0:
#                 ds.append(d)
# # Проверяем парный делитель (i//d) на кратность 6
#             if (i // d) % 6 == 0:
#                 ds.append(i // d)
# # Если уже нашли больше 3 делителей, кратных 6,
# # прерываем внутренний цикл, так как число нам не подходит
#         if len(ds) > 3:
#             break
# # Проверяем условие: ровно 3 делителя, кратных 6
#     if len(ds) == 3:
#         c += 1 # Увеличиваем счетчик подходящих чисел
# # Выводим само число и наибольший из его делителей, кратных 6
#         print(i, max(ds))
# # Если нашли уже 4 подходящих числа, прерываем внешний цикл
#     if c == 4:
#         break
