a = {
    'q0.': ['.', 'S', 'q0'],
    'q1.': ['.', 'S', 'q0'],
    'q2.': ['.', 'S', 'q0'],
    'q5.': ['.', 'S', 'q0'],
    'q6.': ['.', 'S', 'q0'],
    'q00': ['0', 'R', 'q0'],
    'q10': ['1', 'L', 'q2'],
    'q20': ['1', 'R', 'q3'],
    'q40': ['0', 'R', 'q5'],
    'q50': ['1', 'R', 'q6'],
    'q60': ['1', 'R', 'q0'],
    'q01': ['0', 'L', 'q1'],
    'q11': ['1', 'L', 'q2'],
    'q21': ['1', 'R', 'q3'],
    'q31': ['1', 'R', 'q4'],
    'q51': ['1', 'R', 'q6'],
    'q61': ['1', 'R', 'q0'],
}

# В начальный момент времени головка расположена в начале последовательности

s1 = '000000001'
s = list('..' + s1 + '..')
i, c, p = 2, 0, 'q0'
while c != 'S':
    s[i], c, p = a[p+s[i]]
    if c == 'L':
        i -= 1
    else:
        i += 1
    print(''.join(s))