# Два игрока, Петя и Ваня, играют в следующую игру.
# Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя.
# За один ход игрок может убрать в одной из куч два камня
# или уменьшить количество камней в куче в два раза (целочисленное деление).
# Чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
# Количество камней не может быть отрицательно и игрок не может производить действие с кучей если она пуста.
# Игра завершается в тот момент, когда суммарное количество камней в кучах становится не более 12.
# Победителем считается игрок, сделавший последний ход,
# т.е.первым получивший позицию, в которой в кучах будет 12 или меньше камней.
# В начальный момент в первой куче было 25
# камней, во второй куче — S камней, 1 ≤ S ≤ 99.
# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.
# Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети.
# Назовите минимальное значение S, при котором это возможно.

from functools import lru_cache

@lru_cache(None)
def game(first_heap, second_heap, cnt=0):
    if (first_heap + second_heap) <= 12:
        return 0
    if cnt > 6: # вот тут
        return 10 ** 10
    moves = []
    if first_heap - 2 >= 0:
        moves.append(game(first_heap-2, second_heap, cnt + 1))
    if second_heap - 2 >= 0:
        moves.append(game(first_heap, second_heap-2, cnt + 1))
    if first_heap > 0:
        moves.append(game(first_heap//2, second_heap, cnt + 1))
    if second_heap > 0:
        moves.append(game(first_heap, second_heap//2, cnt +1))
    petya_win = [i for i in moves if i <= 0]
    if petya_win:
        return -max(petya_win)+1
    else:
        return -max(moves)

for i in range(1, 100):
    if i == 1:
        if game(25-2, i, 0) == 1 or game(25 // 2, i, 0) == 1 or game(25, i // 2, 0) == 1:
            print(i)
            break
    else:
        if (game(25-2, i, 0) == 1 or
                game(25 // 2, i, 0) == 1 or
                game(25, i - 2, 0) == 1 or
                game(25, i // 2, 0) == 1):
            print(i)
            break