# Два игрока, Петя и Ваня, играют в следующую игру.
# Перед игроками лежит куча камней. Игроки ходят по очереди,
# первый ход делает Петя. За один ход игрок может: убрать из кучи три камня,
# или убрать из кучи семь камней, или уменьшить количество камней в куче в четыре раза (
# количество камней, полученное при делении, округляется до меньшего).
# Например, из кучи в 21 камень за один ход можно получить кучу из 18, 14 или 5 камней.
# Игра завершается, когда количество камней в куче становится не более 21.
# Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу,
# в которой будет 21 или меньше камней.
# В начальный момент в куче было S камней, S ≥ 22.
# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.
# Укажите минимальное значение S, при котором Петя не может выиграть за один ход,
# но при любом ходе Пети Ваня может выиграть своим первым ходом.


from functools import lru_cache

@lru_cache(None)
def game(first_heap):
    if first_heap <= 21:
        return 0
    moves = [game(first_heap-3), game(first_heap-7), game(first_heap // 4)]
    petya_win = [i for i in moves if i <= 0]
    if petya_win:
        return -max(petya_win)+1
    else:
        return -max(moves)

for i in range(22, 100):
    if game(i) == -1:
        print(i)