# Задача. Гоша составляет восьмизначные числа.
# Причём рядом не должны стоять цифры с одинаковым остатком от деления на 5,
# а также на последнем месте может быть только чётная цифра.
# Сколько чисел может составить Гоша?


def count_numbers():
    # Сначала создаем словарь, который показывает,
    # какие цифры относятся к каждому остатку от деления на 5
    # Ключ: остаток (0, 1, 2, 3, 4)
    # Значение: список цифр с таким остатком
    digits_by_rem = {
        0: [0, 5],
        1: [1, 6],
        2: [2, 7],
        3: [3, 8],
        4: [4, 9],
    }

    # Считаем цифры для первой позиции. Каждый элемент соответствует остатку от 0 до 4.
    # Создаем список из 5 нулей. [0, 0, 0, 0, 0]
    # first_counts[0] - сколько цифр с остатком 0 можно поставить на первое место (исключая 0)

    first_counts = [0]*5

    # Перебираем все остатки от 0 до 4:
    for rem in range(5):
        count = 0 # счётчик для этого остатка

        # Перебираем все цифры с данным остатком:
        for i in digits_by_rem[rem]:
            # Проверяем: если это не 0 то можно использовать
            # Соответственно, только для ПЕРВОЙ цифры мы исключаем 0
            if i != 0:
                count += 1

        # Записываем результат этого остатка
        first_counts[rem] = count

    # После этого цикла first_counts = [1, 2, 2, 2, 2]
    # Так как 0 нельзя, а у всех остальных по 2 числа


    # Считаем цифры для ПРОМЕЖУТОЧНЫХ позиций (2-7)
    # Здесь может стоять любая цифра, главное чтобы остаток отличался

    # mid_counts[rem] - сколько всего цифр с остатком rem (для позиций 2-7)
    mid_counts = [len(digits_by_rem[rem]) for rem in range(5)]
    # Результат: [2, 2, 2, 2, 2] так как для каждого остатка по 2 цифры

    # Считаем цифры для ПОСЛЕДНЕЙ 8 позиции. Есть условие,
    # что последняя цифра должна быть четной

    #last_counts[rem] - сколько ЧЕТНЫХ цифр с остатком rem
    last_counts = [0]*5

    for rem in range(5):
        count = 0 # счетчик четных цифр для этого остатка

        #Перебираем все цифры с данным остатком
        for i in digits_by_rem[rem]:
            if i % 2 == 0:
                count += 1


        # Записываем результат
        last_counts[rem] = count

    # После этого цикла last_counts = [1, 1, 1, 1, 1]
    # Потому что для каждого остатка по 2 цифры: одна четная, а другая нечетная



    # Основной блок кода.
    # Создаем таблицу (список списков) для ДП
    # dp[pos][rem] - сколько способов заполнить первые pos+1 цифр,
    #                чтобы последняя цифра имела остаток rem

    # Индексы: pos от 0 до 7: (0-1 цифра ... 7-8цифр)
    # rem от 0 до 4 (остаток последней цифры)
    # Берем first_count как есть
    dp = [first_counts[:]]
    # dp[0] = [1, 2, 2, 2, 2]


    # Заполняем таблицу для позиций 2-7 (индексы 1-6)
    # Это цифры на позициях 2-7

    for pos in range(1, 7):
        new_dp = [0]*5

        # Перебираем все возможные остатки ПРЕДЫДУЩЕЙ цифры:
        for prev_rem in range(5):
            # Если нет ни одного способа получить предыдущую цифру с остатком prev_rem,
            # то пропускаем - нечего дальше считать
            if dp[pos-1][prev_rem] == 0:
                continue

            # Перебираем все возможные остатки ТЕКУЩЕЙ цифры:
            for new_rem in range(5):
                # Условие: Остатки соседних цифр должны различаться
                if new_rem == prev_rem:
                    continue # пропускаем, если остатки совпадают


                # Количество способов получить текущую цифру с остатком
                # new_rem = (кол-во способов получить предыдущую цифру с остатком prev_rem) -
                # * (кол-во цифр с остатком new_rem). Например:
                # Если есть 5 способов получить на предыдущей позиции остаток 1
                # и для нового остатка 0 есть 2 цифры (0, 5)
                # то мы можем получить 5*2 = 10 способов для новой позиции

                new_dp[new_rem] += dp[pos-1][prev_rem] * mid_counts[new_rem]

        # Добавляем новую строку в таблицу dp
        dp.append(new_dp)



    # Считаем ПОСЛЕДНЮЮ цифру. Должна быть четной

    total = 0 # Общий счетчик всех возможных чисел

    # Перебираем все возможные остатки ПРЕДПОСЛЕДНЕЙ цифры
    for prev_rem in range(5):
        # Если нет способов получить такую 7ую цифру, то пропускаем
        if dp[6][prev_rem] == 0:
            continue

        # Перебираем все возможные остатки ПОСЛЕДНЕЙ цифры
        for last_rem in range(5):
            # Остатки должны отличаться
            if last_rem == prev_rem:
                continue


            total += dp[6][prev_rem] * last_counts[last_rem]
    return total

result = count_numbers()
print(result)

