# Алгоритм получает на вход натуральное число N > 1
# и строит по нему новое число R следующим образом:
# 1. Строится двоичная запись числа N.
# 2. Подсчитывается количество нулей и единиц в полученной записи.
# Если их количество одинаково, в конец записи добавляется её
# последняя цифра. В противном случае в конец
# записи добавляется цифра, которая встречается реже.
# 3. Шаг 2 повторяется ещё два раза.
# 4. Результат переводится в десятичную систему счисления.
# При каком наименьшем исходном числе N > 93
# в результате работы алгоритма получится число, кратное 6?

mnn = 10000000000

for n in range(94, 10000):
    r = bin(n)[2:]
    for i in range(3):
        if r.count('0') == r.count('1'):
            r = r + r[-1]
        elif r.count('0') > r.count('1'):
            r = r + '1'
        else:
            r = r + '0'
    r = int(r, 2)
    if r % 6 == 0 and n < mnn:
        mnn = n
print(mnn)