from functools import lru_cache


@lru_cache(None)
# count_moves - счётчик ходов в партии, его мы добавили для того,
# чтобы избежать ошибки превышения лимита рекурсии.
# Это работает следующим образом: если в партии больше 6 ходов, а партия не з
# то такая партия нам не подходит, поскольку в задачах у нас просят значения,
# при которых Ваня или Петя побеждают максимум третьим ходом.
def f(a, b, cnt):
    # Если произведение камней в кучах стало 2048 или больше
    if a * b >= 2048:
        # Прекращаем игру
        return 0
    # Если в игре больше 6 ходов
    if cnt > 6:
        # Прерываем игру
        return 10**10
    t = [f(a + 1, b, cnt+1), f(a * 2, b, cnt+1), f(a, b * 2, cnt+1), f(a, b + 1, cnt+1)]
    n = [i for i in t if i <= 0]
    # Если в данной позиции есть выигрыш Пети
    if n:
        return -max(n) + 1
    # Если в данной позиции выигрыш Вани
    return -max(t)


for s in range(1, 187):
    if f(11, s, 0) == -2:
        print(s)
