# Файл 17text.txt содержит последовательность неотрицательных целых чисел, не превышающих 10 000.
# Определите количество пар,
# в которых хотя бы один из двух элементов заканчивается на 8,
# а их сумма делится на 30.
# В ответе запишите через пробел два числа:
# сначала количество найденных пар, а затем −  максимальное произведение элементов таких пар.
# Парой являются два идущих подряд элемента последовательности.


f = open('D:/INC/tasks17_veb1_home/17text__t2jh (1).txt')
c = 0
mx = -1000000000000000000000000000000000000000
a = [int(i) for i in f]

for i in range(len(a) - 1):
    if ((a[i] % 10 == 8) or (a[i + 1] % 10 == 8)) and ((a[i] + a[i+1]) % 30 == 0):
        c += 1
        mx = max(mx, ((a[i]) * (a[i+1])))

print(c, mx)


# 25 88708176 - Правильный ответ