#В файле содержится последовательность натуральных чисел, каждое из которых не превышает 100 000.
# Определите количество троек элементов последовательности,
# в которых ровно два из трёх элементов являются трёхзначными числами,
# а сумма элементов тройки не больше максимального элемента последовательности,оканчивающегося на 13.
# Гарантируется, что в последовательности есть хотя бы одно число, оканчивающееся на 13.
# В ответе запишите через пробел количество найденных троек чисел,
# затем максимальную из сумм элементов таких троек.
# В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.

f = open('D:/INC/tasks17_veb1_home/17_2024__7bymt (1).txt')
c = 0
mx = -1000000000000000000000000000000

a = [int(i) for i in f]

x13 = max(g for g in a if str(g)[-2:] == '13')

for i in range(len(a) - 2):
    t = [a[i], a[i+1], a[i+2]]

    c1 = [g for g in t if (100 <= g <= 999)]

    if (len(c1) == 2) and (sum(t) <= x13):
        c += 1
        mx = max(mx, sum(t))

print(c, mx)

# 959 97471 - правильный ответ