#Файл содержит последовательность натуральных чисел, не превышающих 100000  .
# Назовём четвёркой четыре идущих подряд элемента последовательности.
# Определите количество четвёрок, для которых выполняются следующие условия:
#1. в четвёрке больше пятизначных чисел, чем трёхзначных;
#2. в четвёрке поровну чисел, кратных 5  , и чисел, кратных 7  ;
#3. сумма элементов четвёрки больше удвоенной суммы максимального и минимального элементов последовательности,
# запись которых заканчивается на 821  . (Гарантируется, что в последовательности есть хотя бы один элемент, запись которого заканчивается на 821  .)
#В ответе запишите два числа через пробел: сначала количество найденных четвёрок, затем максимальную величину суммы элементов этих четвёрок.

f = open('D:/INC/tasks17_veb1_home/17__7jg3g (1).txt')
c = 0
mx = -100000000000000000000000000000000000000000

a = [int(i) for i in f]

max821 = max(g for g in a if str(g)[-3:] == '821')
min821 = min(g for g in a if str(g)[-3:] == '821')

for i in range(len(a) - 3):
    t = [a[i], a[i+1], a[i+2], a[i+3]]

    p5 = [j for j in t if (10000 <= j <= 99999)]
    t3 = [j for j in t if (100 <= j <= 999)]

    c5 = [j for j in t if j % 5 == 0]
    c7 = [j for j in t if j % 7 == 0]

    if (len(p5) > len(t3)) and (len(c5) == len(c7)) and (sum(t) > (2 * (max821 + min821))):
        c += 1
        mx = max(mx, sum(t))

print(c, mx)


# 859 279352 - правильный ответ

