#Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел.
#Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:
#— каждое число в строке встречается по одному разу,
#— утроенная сумма максимального и минимального значений не превышает удвоенной суммы оставшихся чисел.
#В ответе запишите только число.

f = open('D:/INC/tasks17_veb1_home/9__1v7o1 (1).csv')
c = 0

for i in f:
    a = sorted(map(int, i.split(',')))

    c1 = len([g for g in a if a.count(g) == 1])

    if (c1 == 5) and ((3*(a[4] + a[0])) <= (2 * (a[1] + a[2] + a[3]))):
        c += 1

print(c)


# 853 = правильный ответ
