#В файле содержится последовательность целых чисел.
# Элементы последовательности могу принимать целые значения от 0 до 10000 включительно.
# Определите и запишите в ответе через пробел сначала количество пар элементов,
# произведение которых кратно 12 и сумма кратна 13,
# затем максимальную сумму среди элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
#Например для последовательности из шести элементов:
#36; 16; 133; 5; 28; 19;
# Ответ: 1 52


f = open('D:/INC/tasks17_veb1_home/Задание_17__c1ms__spco (1).txt')
c = 0
mx = -10000000000000000000000

a = [int(i) for i in f]

for i in range(len(a) - 1):
    if (((a[i]) * (a[i + 1])) % 12 == 0) and ((a[i] + a[i + 1]) % 13 == 0):
        c += 1
        mx = max(mx, (a[i] + a[i + 1]))

print(c, mx)

# 214 19292 - правильный ответ