#Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа.
# Определите количество строк таблицы, содержащих числа, для которых выполнено условие:
#– среди четырёх чисел есть только одна пара равных чисел, остальные числа различны.
#В ответе запишите только число.

f = open('D:/INC/tasks17_veb1_home/9_7__1v7m3 (1).csv')
c = 0

for i in f:
    a = sorted(map(int, i.split(',')))

    c2 = len([j for j in a if a.count(j) == 2])
    c1 = len([j for j in a if a.count(j) == 2])

    if (c2 ==2 and c1 == 2):
        c += 1

print(c)

#345 правильный ответ