#Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел.
# Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:
#- в строке только одно число повторяется ровно два раза, остальные числа различны;
#- среднее арифметическое неповторяющихся чисел строки не больше суммы повторяющихся чисел.
# В ответе запишите только число.

f = open('D:/INC/tasks17_veb1_home/9-2__1vnav (1).csv')
c = 0

for i in f:
    a = sorted(map(int, i.split(',')))

    c2 = [g for g in a if a.count(g) == 2]

    c1 = [g for g in a if a.count(g) == 1]


    if ((len(c2) == 2) and (len(c1) == 4)) and ((sum(c1)/len(c1)) <= sum(c2)):
        c += 1

print(c)

# 35 - правильный ответ