#Файл содержит последовательность натуральных чисел, не превышающих 100 000  .
# Назовём тройкой три идущих подряд элемента последовательности.
# Определите количество троек, для которых выполняются следующие условия:
#1. хотя бы два числа в тройке являются пятизначными;
#2. ровно одно число в тройке делится на 3  ;
#3. сумма элементов тройки больше максимального элемента последовательности, запись которого заканчивается на 123.
# (Гарантируется, что в последовательности есть хотя бы один элемент, запись которого заканчивается на 123.)
#В ответе запишите два числа через пробел: сначала количество найденных троек, затем максимальную величину суммы элементов этих троек.

f = open('D:/INC/tasks17_veb1_home/17__7jgi4 (1).txt')
c = 0
mx = -10000000000000000000000000000000000000
a = [int(i) for i in f]

max123 = max(g for g in a if str(g)[-3:] == '123')

for i in range(len(a) - 2):
    t = [a[i], a[i+1], a[i+2]]
    p1 = [g for g in t if (10000 <= g <= 99999)]
    p2 = [g for g in t if (g % 3 == 0)]

    if (len(p1) >= 2) and (len(p2) == 1) and (sum(t) > max123):
        c += 1
        mx = max(mx, sum(t))

print(c, mx)

# 336 253152 - правильный ответ