#В файле электронной таблицы в каждой строке содержатся пять натуральных чисел.
# Определите количество строк таблицы, содержащей числа, для которых выполнены оба условия:
#– в строке все числа уникальные;
#– среднее арифметическое двух наибольших чисел не больше суммы 3 наименьших.

f = open('D:/INC/tasks17_veb1_home/9_5__1vc31 (1).csv')
c= 0

for i in f:
    a = sorted(map(int, i.split(',')))
    if (len(set([g for g in a])) == 5) and (((a[3] + a[4]) / 2) <= (a[0] + a[1] + a[2])):
        c += 1

print(c)


# 1080 - правильный ответ