#Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел.
# Определите количество строк таблицы, для чисел которых выполнены оба условия:
#– в строке есть одно число, которое повторяется трижды, остальные три числа различны;
#– повторяющееся число строки меньше среднего арифметического всех её чисел.
#В ответе запишите только число.

f = open('D:/INC/tasks17_veb1_home/9-1__1___2asuq (1).csv')
c = 0
for i in f:
    a = sorted(map(int, i.split(',')))

    c3 = [g for g in a if a.count(g) == 3]
    c1 = [g for g in a if a.count(g) == 1]


    if ((len(c3) == 3) and (len(c1) == 3)) and ((sum(a)/len(a)) > c3[0]):
        c += 1

print(c)

# 18 - правильный ответ