f = open('/Users/shagal/Desktop/shagalievv/Школково/Информатика/tasks/26_1M__3whph.txt')
count_details = int(f.readline())
array_details = []#список, в котором у нас будут все детали файла
for i in range(count_details):
    detail = list(map(int,f.readline().split()))
    if detail[0] > detail[1]:#если второе число меньше первого
        array_details.append((detail[1],"paint",i+1))#то добавляем второе число, указываем,
        # что эту деталь отправим на покраску и передаём её номер
    else:#в ином случае
        array_details.append((detail[0],"grind",i+1))#тогда добавляем первое число, указываем,
        #что эту деталь отправим на шлифовку и передаём её номер
array_details.sort()
lenta = [0]*count_details#симулируем ленту транспортёра
details = []#список, в котором у нас будут детали, которые мы положили на ленту
for detail in array_details:#проход по всевозможным деталям файла
    if detail[1] == "grind":#если эту деталь нужно отправить на шлифовку
        for i in range(len(lenta)):#то делаем перебор с начала ленты
            if lenta[i] == 0:#если эта ячейка свободна
                lenta[i] = 1#указываем, что она занята
                details.append(detail)
                break#сброс цикла для того, чтобы перейти к следующей детали
    else:#в ином случае
        for i in range(len(lenta)-1,-1,-1):#перебор с конца ленты
            if lenta[i] == 0:#если эта ячейка свободна
                lenta[i] = 1#указываем, что она занята
                details.append(detail)
                break#сброс цикла для того, чтобы перейти к следующей детали
#выводим номер, предпоследней детали, а также количество покрашенных деталей до этой детали
print(details[-2][2])
# так как предпоследняя деталь будет центральной на ленте и эта деталь отправленная на шлифовку
# то до нее не будет покрашено ни одной детали

