from ipaddress import *

# В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 2 ** 32
# в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
# Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети.
# Обычно маска записывается по тем же правилам, что и IP-адрес – в виде четырёх байт,
# причём каждый байт записывается в виде десятичного числа.
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
# Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.
# Для узла с IP-адресом 16.153.206.18 адрес сети равен 16.153.200.0.
# Определите значение третьего слева байта маски сети.

for mask in range(32):
    net = ip_network('16.153.206.18/' + str(mask), 0)
    print(net, net.netmask)