from ipaddress import *

# В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает,
# какая часть IP-адреса узла сети относится к адресу сети,
# а какая – к адресу узла в этой сети.
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.
# Узлы с IP-адресами 104.54.106.232 и 104.54.36.112 находятся в разных сетях.
# Известно, что в масках обеих сетей одинаковое количество единиц,
# а в адресах обеих сетей нечётное количество единиц.
# Укажите наименьшее возможное количество единиц в маске сетей.

for mask in range(32):
    net1 = ip_network('104.54.106.232/' + str(mask), 0)
    net2 = ip_network('104.54.36.112/' + str(mask), 0)
    if net1 != net2:
        c1 = bin(int(net1[0]))[2:].zfill(32)
        c2 = bin(int(net2[0]))[2:].zfill(32)
        if c1.count('1') % 2 != 0 and c2.count('1') % 2 != 0:
            print(mask)