from ipaddress import *

# В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 2 ** 32;
# в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
# Маска определяет, какая часть IP-адреса узла сети относится к адресу сети,
# а какая – к адресу самого узла в этой сети.
# Обычно маска записывается по тем же правилам,
# что и IP-адрес – в виде четырех байтов, причем каждый байт записывается в виде десятичного числа.
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
# Например, если IP-адрес узла равен 131.32.255.131,
# а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.
# Определите номер компьютера в сети,
# если маска подсети равна 255.255.128.0 и IP-адрес компьютера в сети 166.229.54.0.
# Ответ запишите в десятичной системе счисления.

n = ip_network('166.229.54.0/255.255.128.0', 0)
i = ip_address('166.229.54.0')
nm = int(i) - int(n.network_address)
print(nm)