from ipaddress import *

# В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 2 ** 32;
# в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
# Маска определяет, какая часть IP-адреса узла сети относится к адресу сети,
# а какая — к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам,
# что и IP-адрес — в виде четырех байтов, причем каждый байт записывается в виде десятичного числа.
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
# Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.
# Для узла с IP-адресом 10.43.180.188 адрес сети равен 10.43.180.0.
# Чему равно наибольшее и наименьшее количество возможных адресов в этой сети?
# В ответе укажите через пробел сначала наибольшее число адресов, а затем наименьшее.

net = ip_address('10.43.180.0')

for mask in range(32):
    net1 = ip_network('10.43.180.188/' + str(mask), 0)
    if net == net1[0]:
        print(len(list(net1)))