from ipaddress import *

# В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 2 ** 32;
# в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
# Маска определяет, какая часть IP-адреса узла сети относится к адресу сети,
# а какая – к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам,
# что и IP-адрес – в виде четырёх байт, причём каждый байт записывается в виде десятичного числа.
# Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
# Например, если IP-адрес узла равен 192.168.5.17, а маска равна 255.255.255.0, то адрес сети равен 192.168.5.0.
# Для узла с IP-адресом 230.5.60.68 адрес сети равен 230.5.60.64.
# Определите максимально возможное количество физических устройств в этой сети.

net = ip_address('230.5.60.64')

for mask in range(32):
    net1 = ip_network('230.5.60.68/' + str(mask), 0)
    if net == net1[0]:
        print(len(list(net1.hosts())))